** Now for some arithmetic, followed by printouts
   :PROPERTIES:
   :CUSTOM_ID: now-for-some-arithmetic-followed-by-printouts
   :END:

We will experimentally confirm that ADD and MUL work correctly,
obtaining printouts in the form of standard numerals, thanks to the
ChurchToNat helper function. We begin with seeing how ZERO and S work.

#+BEGIN_SRC python :results output :noweb eval
    <<prelim>>
    <<conversion>>
    print(ChurchToNat(ZERO))
#+END_SRC

#+RESULTS:
: 0

#+BEGIN_EXAMPLE
    0
#+END_EXAMPLE

#+BEGIN_SRC python
    ChurchToNat(S(ZERO))
#+END_SRC

#+BEGIN_EXAMPLE
    1
#+END_EXAMPLE

#+BEGIN_SRC python
    ChurchToNat(S(S(ZERO)))
#+END_SRC

#+BEGIN_EXAMPLE
    2
#+END_EXAMPLE

#+BEGIN_SRC python :results output :noweb eval
  <<prelim>>
  <<addmul>>
  <<conversion>>
    # Let us do 1+2, giving us 3
  print(ChurchToNat( ADD(S(ZERO))(S(S(ZERO)))))
#+END_SRC

#+RESULTS:
: 3

#+BEGIN_EXAMPLE
    3
#+END_EXAMPLE

#+BEGIN_SRC python :results output :noweb eval
  <<prelim>>
  <<addmul>>
  <<conversion>>
    # Let us do 2*3, giving us 6
  print(ChurchToNat( MUL(S(S(ZERO))) (S(S(S(ZERO))))))
#+END_SRC

#+RESULTS:
: 6

#+BEGIN_EXAMPLE
    6
#+END_EXAMPLE

#+BEGIN_SRC python :results output :noweb eval
  <<prelim>>
  <<conversion>>
    # The lambda function itself is not printed
  print(NatToChurch(7))
#+END_SRC

#+RESULTS:
: <function <lambda> at 0x105d7e848>

#+BEGIN_EXAMPLE
    <function __main__.<lambda>.<locals>.<lambda>>
#+END_EXAMPLE

#+BEGIN_SRC python :results output :noweb eval
  <<prelim>>
  <<conversion>>
    # But we can show it via ChurchToNat
  print(ChurchToNat(NatToChurch(7)))
#+END_SRC

#+RESULTS:
: 7

#+BEGIN_EXAMPLE
    7
#+END_EXAMPLE

The definitions of various arithmetic operations seem to be exactly as
we expect.

** Onto the first recursive definition
   :PROPERTIES:
   :CUSTOM_ID: onto-the-first-recursive-definition
   :END:

We now have built-up enough machinery to show you how we can handle
recursive functions.

We can write the following without (we hope) surprising you one bit:

- fact = Ye prefact : In other words, fact is obtained by finding a
  fixpoint of prefact.

- To see this working, we can calculate fact 3, fact 4, and fact 5.
  Given that we are working with standard numerals (and not Church
  numerals), we can run without any printing aids such as ChurchToNat.

- We can similarly give fib and prefib a go.

#+BEGIN_SRC python :results output :noweb eval
    <<eagerY>>
    <<prefuncs>>
    fact = Ye(prefact)
    print(fact(5))
#+END_SRC

#+RESULTS:
: 120

#+BEGIN_EXAMPLE
    120
#+END_EXAMPLE

#+BEGIN_SRC python :results output :noweb eval
    <<eagerY>>
    <<prefuncs>>
    fib = Ye(prefib)
    print(fib(5))
#+END_SRC

#+RESULTS:
: 5

#+BEGIN_EXAMPLE
    5
#+END_EXAMPLE

* END: this finishes fixpoint theory defined in Jove
  :PROPERTIES:
  :CUSTOM_ID: end-this-finishes-fixpoint-theory-defined-in-jove
  :END:

#+BEGIN_SRC python :results output :noweb eval
    <<eagerY>>
    <<prefuncs>>
    print(Ye(presum)(10))
#+END_SRC

#+RESULTS:
: 55

#+BEGIN_EXAMPLE
    55
#+END_EXAMPLE
